{
    "experiences": [
        {
            "title": "Reserach Assistant",
            "subtitle": "Center for Unified Biometrics and Sensors, University at Buffalo",
            "workType": "Part-Time",
            "workDescription": [
                "Building a real-time multimodal Active Speaker Localization system that leverages audio and image embeddings extracted from video data. ",
                "LIP sync score are used to identify the active speaker in multi-speaker scenarios. This project is funded by NSF AI Institute for Transforming Education for Children with Speech and Language Processing Challenges."
            ],
            "dateText": "07/2024 – Present"
        },
        {
            "title": "Research Assistant",
            "subtitle": "Suny Research Foundation, University at Buffalo",
            "workType": "Full-Time",
            "workDescription": [
                "Designed a robust casual modelling pipeline to identify a toddler as Late Talker or Typically Developing using parent child audio conversations.",
                "Implemented three key components: Audio transcription and diarization using OpenAI Whisper and Pyannote, identification of novel part-of-speech tags, and causal modeling to analyze word usage representative of late talkers.",
                "Annotated a large dataset comprising 2.5 million words and a 40K vocabulary across new categories: Shape/Non-Shape nouns and Result/Manner verbs. Leveraged GPT 4o-mini and LLama 3.1 405B models to annotate the dataset with a carefully crafted prompt.",
                "Finetuned Roberta base, achieving 94% accuracy in classifying Shape/ Non-shape nouns and 97% on Result/ Manner Verbs."
            ],
            "dateText": "05/2024 – Present"
        },
        {
            "title": "Data Science Lead Assistant Manager",
            "subtitle": "EXL Analytics, Gurgaon",
            "workType": "Full-Time",
            "workDescription": [
                "Continuous Data Integrity Tool: Implemented robust data quality controls to bolster integrity of all Credit & Fraud risk decision science models in American Express. This automated extract & transform (ETL) pipeline to safeguard against data discrepancies at an early stage. Attained an impressive 81% mean outlier alert accuracy on 240 plus datasets, reducing manual verification efforts by 30%.",
                "Risk Strategy and Remediation Tool: Developed a data‑driven strategy to adjust credit lines based on real-time transactional behaviors. Directed a team of three towards development of backend systems on JAVA, and Business Logic Model on Python. I oversaw the optimization of database meta data and interactions, utilizing Hadoop & HBase for optimal data management & accessibility, powered by Hive over Tez engine. Engineered model consistently outperformed FICO scores in accuracy, hitting significant positive lift and GINI coefficient improvements. Strategic advancement resulted in a 5% reduction in delinquent losses."
            ],
            "dateText": "11/2021 – 06/2023"
        },
        {
            "title": "Analytics Deputy Manager",
            "subtitle": "Suzuki Motors India Limited, Gurgaon",
            "workType": "Full-Time",
            "workDescription": [
                "Inventory Management & SKU Demand Forecasting: Crafted a forecasting model by integrating ABC and XYZ analysis to provide live insights on SKU availability, safety stock, & reorder points for over 4,000 parts. Integrated SARIMA with LSTM framework to predict delivery times of critical spare parts, enhancing the Order to Delivery Process Analysis and Inventory Optimization.",
                "Increased inventory turnover ratio from 3.2 to 4.7 leading to annual cost savings of $7 million by reducing wastage."
            ],
            "dateText": "07/2017 – 11/2021"
        }
    ]
}